# Usgph Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Usgph Property
SymbolTypeId Class See Also
---
Symbol usgph, indicating unit US gallons per hour.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Usgph { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Usgph As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Usgph {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace